---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotCreatePanelScheduleDuetoNoDefaultTemplate
source: html/8f6d9011-785e-c07f-ad20-90997dc67a08.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotCreatePanelScheduleDuetoNoDefaultTemplate Property

A panel schedule cannot be created for these panels. A default panel schedule template must be assigned for this template type.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreatePanelScheduleDuetoNoDefaultTemplate { get; }
```